In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\mayh\OneDrive - A STAR\atac_seq\blood_prepare\GSE129785_scATAC-Hematopoiesis-All.peaks.txt\GSE129785_scATAC-Hematopoiesis-All.peaks.txt", sep='_', index_col = False, header = None)

In [3]:
df

           0          1          2
0       chr1      10238      10738
1       chr1     115476     115976
2       chr1     236856     237356
3       chr1     237511     238011
4       chr1     240801     241301
...      ...        ...        ...
571395  chrX  155249323  155249823
571396  chrX  155253875  155254375
571397  chrX  155254735  155255235
571398  chrX  155259327  155259827
571399  chrX  155260029  155260529

[571400 rows x 3 columns]

In [4]:
df.shape

(571400, 3)

In [5]:
type(df[1][0])

numpy.int64

In [6]:
df.isna().sum()

0    0
1    0
2    0
dtype: int64

In [7]:
df['length'] = df[2].sub(df[1], axis = 0)
df

           0          1          2  length
0       chr1      10238      10738     500
1       chr1     115476     115976     500
2       chr1     236856     237356     500
3       chr1     237511     238011     500
4       chr1     240801     241301     500
...      ...        ...        ...     ...
571395  chrX  155249323  155249823     500
571396  chrX  155253875  155254375     500
571397  chrX  155254735  155255235     500
571398  chrX  155259327  155259827     500
571399  chrX  155260029  155260529     500

[571400 rows x 4 columns]

In [8]:
df[df['length'] != 500]

Empty DataFrame
Columns: [0, 1, 2, length]
Index: []

In [10]:
df.to_csv('blood_all_peaks.txt', sep='\t', index=False, header=False)